MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472KCHI/mcu.h
/*  Bit definition for GPIO_POERB register  */
#define GPIO_POERB_POUTE00_POS                         (0U)
#define GPIO_POERB_POUTE00                             (0x0001U)
#define GPIO_POERB_POUTE01_POS                         (1U)
#define GPIO_POERB_POUTE01                             (0x0002U)
#define GPIO_POERB_POUTE02_POS                         (2U)
#define GPIO_POERB_POUTE02                             (0x0004U)
#define GPIO_POERB_POUTE03_POS                         (3U)
#define GPIO_POERB_POUTE03                             (0x0008U)
#define GPIO_POERB_POUTE04_POS                         (4U)
#define GPIO_POERB_POUTE04                             (0x0010U)
#define GPIO_POERB_POUTE05_POS                         (5U)
#define GPIO_POERB_POUTE05                             (0x0020U)
#define GPIO_POERB_POUTE06_POS                         (6U)
#define GPIO_POERB_POUTE06                             (0x0040U)
#define GPIO_POERB_POUTE07_POS                         (7U)
#define GPIO_POERB_POUTE07                             (0x0080U)
#define GPIO_POERB_POUTE08_POS                         (8U)
#define GPIO_POERB_POUTE08                             (0x0100U)
#define GPIO_POERB_POUTE09_POS                         (9U)
#define GPIO_POERB_POUTE09                             (0x0200U)
#define GPIO_POERB_POUTE12_POS                         (12U)
#define GPIO_POERB_POUTE12                             (0x1000U)
#define GPIO_POERB_POUTE13_POS                         (13U)
#define GPIO_POERB_POUTE13                             (0x2000U)
#define GPIO_POERB_POUTE14_POS                         (14U)
#define GPIO_POERB_POUTE14                             (0x4000U)
#define GPIO_POERB_POUTE15_POS                         (15U)
#define GPIO_POERB_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRB register  */
#define GPIO_POSRB_POS00_POS                           (0U)
#define GPIO_POSRB_POS00                               (0x0001U)
#define GPIO_POSRB_POS01_POS                           (1U)
#define GPIO_POSRB_POS01                               (0x0002U)
#define GPIO_POSRB_POS02_POS                           (2U)
#define GPIO_POSRB_POS02                               (0x0004U)
#define GPIO_POSRB_POS03_POS                           (3U)
#define GPIO_POSRB_POS03                               (0x0008U)
#define GPIO_POSRB_POS04_POS                           (4U)
#define GPIO_POSRB_POS04                               (0x0010U)
#define GPIO_POSRB_POS05_POS                           (5U)
#define GPIO_POSRB_POS05                               (0x0020U)
#define GPIO_POSRB_POS06_POS                           (6U)
#define GPIO_POSRB_POS06                               (0x0040U)
#define GPIO_POSRB_POS07_POS                           (7U)
#define GPIO_POSRB_POS07                               (0x0080U)
#define GPIO_POSRB_POS08_POS                           (8U)
#define GPIO_POSRB_POS08                               (0x0100U)
#define GPIO_POSRB_POS09_POS                           (9U)
#define GPIO_POSRB_POS09                               (0x0200U)
#define GPIO_POSRB_POS12_POS                           (12U)
#define GPIO_POSRB_POS12                               (0x1000U)
#define GPIO_POSRB_POS13_POS                           (13U)
#define GPIO_POSRB_POS13                               (0x2000U)
#define GPIO_POSRB_POS14_POS                           (14U)
#define GPIO_POSRB_POS14                               (0x4000U)
#define GPIO_POSRB_POS15_POS                           (15U)
#define GPIO_POSRB_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRB register  */
#define GPIO_PORRB_POR00_POS                           (0U)
#define GPIO_PORRB_POR00                               (0x0001U)
#define GPIO_PORRB_POR01_POS                           (1U)
#define GPIO_PORRB_POR01                               (0x0002U)
#define GPIO_PORRB_POR02_POS                           (2U)
#define GPIO_PORRB_POR02                               (0x0004U)
#define GPIO_PORRB_POR03_POS                           (3U)
#define GPIO_PORRB_POR03                               (0x0008U)
#define GPIO_PORRB_POR04_POS                           (4U)
#define GPIO_PORRB_POR04                               (0x0010U)
#define GPIO_PORRB_POR05_POS                           (5U)
#define GPIO_PORRB_POR05                               (0x0020U)
#define GPIO_PORRB_POR06_POS                           (6U)
#define GPIO_PORRB_POR06                               (0x0040U)
#define GPIO_PORRB_POR07_POS                           (7U)
#define GPIO_PORRB_POR07                               (0x0080U)
#define GPIO_PORRB_POR08_POS                           (8U)
#define GPIO_PORRB_POR08                               (0x0100U)
#define GPIO_PORRB_POR09_POS                           (9U)
#define GPIO_PORRB_POR09                               (0x0200U)
#define GPIO_PORRB_POR12_POS                           (12U)
#define GPIO_PORRB_POR12                               (0x1000U)
#define GPIO_PORRB_POR13_POS                           (13U)
#define GPIO_PORRB_POR13                               (0x2000U)
#define GPIO_PORRB_POR14_POS                           (14U)
#define GPIO_PORRB_POR14                               (0x4000U)
#define GPIO_PORRB_POR15_POS                           (15U)
#define GPIO_PORRB_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRB register  */
#define GPIO_POTRB_POT00_POS                           (0U)
#define GPIO_POTRB_POT00                               (0x0001U)
#define GPIO_POTRB_POT01_POS                           (1U)
#define GPIO_POTRB_POT01                               (0x0002U)
#define GPIO_POTRB_POT02_POS                           (2U)
#define GPIO_POTRB_POT02                               (0x0004U)
#define GPIO_POTRB_POT03_POS                           (3U)
#define GPIO_POTRB_POT03                               (0x0008U)
#define GPIO_POTRB_POT04_POS                           (4U)
#define GPIO_POTRB_POT04                               (0x0010U)
#define GPIO_POTRB_POT05_POS                           (5U)
#define GPIO_POTRB_POT05                               (0x0020U)
#define GPIO_POTRB_POT06_POS                           (6U)
#define GPIO_POTRB_POT06                               (0x0040U)
#define GPIO_POTRB_POT07_POS                           (7U)
#define GPIO_POTRB_POT07                               (0x0080U)
#define GPIO_POTRB_POT08_POS                           (8U)
#define GPIO_POTRB_POT08                               (0x0100U)
#define GPIO_POTRB_POT09_POS                           (9U)
#define GPIO_POTRB_POT09                               (0x0200U)
#define GPIO_POTRB_POT12_POS                           (12U)
#define GPIO_POTRB_POT12                               (0x1000U)
#define GPIO_POTRB_POT13_POS                           (13U)
#define GPIO_POTRB_POT13                               (0x2000U)
#define GPIO_POTRB_POT14_POS                           (14U)
#define GPIO_POTRB_POT14                               (0x4000U)
#define GPIO_POTRB_POT15_POS                           (15U)
#define GPIO_POTRB_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRE register  */
#define GPIO_PIDRE_PIN07_POS                           (7U)
#define GPIO_PIDRE_PIN07                               (0x0080U)
#define GPIO_PIDRE_PIN08_POS                           (8U)
#define GPIO_PIDRE_PIN08                               (0x0100U)

/*  Bit definition for GPIO_PODRE register  */
#define GPIO_PODRE_POUT07_POS                          (7U)
#define GPIO_PODRE_POUT07                              (0x0080U)
#define GPIO_PODRE_POUT08_POS                          (8U)
#define GPIO_PODRE_POUT08                              (0x0100U)

